

var vLine = {"_1":"美洲","_2":"大洋洲","_3":"歐洲","_4":"亞非","_5":"大陸港澳","_6":"東北亞","_7":"東南亞"};


var LineArr = {
  "_4": [
    "_AE",
    "_BD",
    "_BH",
    "_IL",
    "_IN",
    "_JO",
    "_KZ",
    "_LK",
    "_NP",
    "_PK",
    "_QA",
    "_SN",
    "_TR",
    "_YE"
  ],
  "_1": [
    "_AR",
    "_CA",
    "_CL",
    "_MX",
    "_PA",
    "_PE",
    "_US",
    "_UY",
    "_VE"
  ],
  "_3": [
    "_AT",
    "_BA",
    "_BE",
    "_BG",
    "_CH",
    "_CZ",
    "_DE",
    "_DK",
    "_ES",
    "_FI",
    "_FR",
    "_GR",
    "_HR",
    "_HU",
    "_IE",
    "_IT",
    "_LU",
    "_MK",
    "_NL",
    "_NO",
    "_PL",
    "_PT",
    "_RO",
    "_RU",
    "_SE",
    "_SI",
    "_SK",
    "_UK"
  ],
  "_2": [
    "_AU",
    "_NZ"
  ],
  "_5": [
    "_CN",
    "_MN"
  ],
  "_7": [
    "_ID",
    "_KH",
    "_LA",
    "_MM",
    "_MY",
    "_PH",
    "_SG",
    "_TH",
    "_VN"
  ],
  "_6": [
    "_JP",
    "_KR"
  ]

};


var CountryArr=
{
  '_': '不限',
    '_AU': '澳大利亞',
    '_TW': '中華民國',
    '_UK': '英國',
    '_US': '美國',
    '_CA': '加拿大',
    '_FR': '法國',
    '_NZ': '紐西蘭',
    '_SG': '新加坡',
    '_TH': '泰國',
    '_ID': '印尼',
    '_NL': '荷蘭',
    '_MY': '馬來西亞',
    '_PH': '菲律賓',
    '_VN': '越南',
    '_AE': '阿拉伯聯合大公國',
    '_AR': '阿根廷',
    '_AT': '奧地利',
    '_BA': '波士尼亞及赫塞哥維納',
    '_BD': '孟加拉',
    '_BE': '比利時',
    '_BG': '保加利亞',
    '_BH': '巴林',
    '_CH': '瑞士',
    '_CL': '智利',
    '_CN': '中國大陸',
    '_CZ': '捷克',
    '_DE': '德國',
    '_DK': '丹麥',
    '_ES': '西班牙',
    '_FI': '芬蘭',
    '_GR': '希臘',
    '_HR': '克羅埃西亞',
    '_HU': '匈牙利',
    '_IE': '愛爾蘭',
    '_IL': '以色列',
    '_IN': '印度',
    '_IT': '義大利',
    '_JO': '約旦',
    '_JP': '日本',
    '_KH': '柬埔寨',
    '_KR': '韓國',
    '_KZ': '哈薩克共和國',
    '_LA': '寮國',
    '_LK': '斯里蘭卡',
    '_LU': '盧森堡',
    '_MK': '馬其頓',
    '_MM': '緬甸',
    '_MN': '蒙古',
    '_MX': '墨西哥',
    '_NO': '挪威',
    '_NP': '尼泊爾',
    '_PA': '巴拿馬',
    '_PE': '祕魯',
    '_PK': '巴基斯坦',
    '_PL': '波蘭',
    '_PT': '葡萄牙',
    '_QA': '卡達',
    '_RO': '羅馬尼亞',
    '_RU': '俄羅斯聯邦',
    '_SE': '瑞典',
    '_SI': '斯洛維尼亞',
    '_SK': '斯洛伐克',
    '_SN': '塞內加爾',
    '_TR': '土耳其',
    '_UY': '烏拉圭共和國',
    '_VE': '委內瑞拉',
    '_YE': '葉門'
};


var CityArr={
  '_AU': {
    '_': '不限',
    '_SYD': '雪梨',
    '_MEL': '墨爾本',
    '_PER': '柏斯',
    '_ADL': '阿德雷德',
    '_CNS': '凱恩斯',
    '_OOL': '黃金海岸',
    '_HBA': '荷巴特',
    '_WSY': '艾利海灘',
    '_BLR': '巴拉瑞特'
  },
  '_TW': {
    '_': '不限',
    '_TPE': '台北',
    '_TAO': '桃園',
    '_HCU': '新竹',
    '_MLI': '苗栗',
    '_TCH': '台中',
    '_CHA': '彰化',
    '_NTO': '南投',
    '_YLI': '雲林',
    '_CYI': '嘉義',
    '_TNN': '台南',
    '_KHH': '高雄',
    '_PIN': '屏東',
    '_YLN': '宜蘭',
    '_HLN': '花蓮',
    '_TTT': '台東'
  },
  '_UK': {
    '_': '不限',
    '_LON': '倫敦',
    '_QQX': '巴斯'
  },
  '_US': {
    '_': '不限',
    '_LAX': '洛杉磯-加州',
    '_SFO': '舊金山-加州',
    '_LAS': '拉斯維加斯-內華達州',
    '_NYC': '紐約-紐約州',
    '_SEA': '西雅圖-華盛頓州',
    '_PHX': '鳳凰城-亞利桑那州',
    '_CHI': '芝加哥-伊利諾州',
    '_ATL': '亞特蘭大-喬治亞州',
    '_ORL': '奧蘭多-佛州',
    '_GUM': '關島',
    '_SPN': '塞班'
  },
  '_CA': {
    '_': '不限',
    '_YVR': '溫哥華'
  },
  '_FR': {
    '_': '不限',
    '_PAR': '巴黎',
    '_MSM': '聖米歇爾山',
    '_VRL': 'VERSAILLES'
  },
  '_SG': {
    '_': '不限',
    '_SIN': '新加坡'
  },
  '_TH': {
    '_': '不限',
    '_BKK': '曼谷',
    '_PYX': '芭達雅',
    '_HKT': '普吉島',
    '_USM': '蘇美島',
    '_HHQ': '華欣',
    '_AYU': '大城'
  },
  '_NL': {
    '_': '不限',
    '_AMS': '阿姆斯特丹'
  },
  '_MY': {
    '_': '不限',
    '_KUL': '吉隆坡'
  },
  '_AT': {
    '_': '不限',
    '_VIE': '維也納',
    '_SZG': '薩爾斯堡'
  },
  '_CN': {
    '_': '不限',
    '_HKG': '香港',
    '_MFM': '澳門',
    '_SHA': '上海',
    '_PEK': '北京'
  },
  '_CZ': {
    '_': '不限',
    '_PRG': '布拉格'
  },
  '_DE': {
    '_': '不限',
    '_FRA': '法蘭克福',
    '_DUS': '杜塞道夫',
    '_HAM': '漢堡'
  },
  '_ES': {
    '_': '不限',
    '_MAD': '馬德里',
    '_BCN': '巴塞隆納',
    '_TOL': '托雷多'
  },
  '_IT': {
    '_': '不限',
    '_ROM': '羅馬',
    '_FLR': '佛羅倫斯',
    '_NAP': '拿坡里',
    '_ANA': 'ANACAPRI',
    '_POM': '龐貝'
  },
  '_JP': {
    '_': '不限',
    '_TYO': '東京',
    '_OSA': '大阪',
    '_KYO': '京都',
    '_KOB': '神戶市-兵庫縣',
    '_NAR': '奈良市-奈良縣',
    '_FUK': '福岡市-福岡縣',
    '_OKA': '沖繩',
    '_NGO': '名古屋-愛知縣',
    '_SPK': '札幌-北海道',
    '_URA': '浦安市(迪士尼)-千葉縣',
    '_JHA': '箱根-神奈川縣',
    '_YOK': '橫濱-神奈川縣',
    '_KAL': '輕井澤-長野縣',
    '_NKO': '日光(鬼怒川)-栃木縣',
    '_QNG': '長野市-長野縣',
    '_ATA': '熱海溫泉-靜岡縣',
    '_FJJ': '富士市-靜岡縣',
    '_FSZ': '靜岡市-靜岡縣',
    '_HMA': '濱松市-靜岡縣',
    '_IDO': '伊豆市-靜岡縣',
    '_JPN': '大津(琵琶湖)-滋賀縣',
    '_FUC': '河口湖-山梨縣',
    '_YNS': '山梨市-山梨縣',
    '_HIJ': '廣島市-廣島縣',
    '_KMJ': '熊本市-熊本縣',
    '_SDJ': '仙台市-宮城縣',
    '_AOJ': '青森市-青森縣',
    '_AXT': '秋田市-秋田縣',
    '_KIJ': '新潟市-新潟縣',
    '_TYI': '豐橋市-愛知縣',
    '_KLO': '下呂町-岐阜縣',
    '_TKY': '高山市-岐阜縣',
    '_KUO': '黑部市-富山縣',
    '_TAA': '高岡市-富山縣',
    '_TOY': '富山市-富山縣',
    '_KAA': '加賀市-石川縣',
    '_KMQ': '小松市-石川縣',
    '_KZA': '金澤市-石川縣',
    '_FKJ': '福井市-福井縣',
    '_TUG': '敦賀市-福井縣',
    '_TAK': '高松市-香川縣',
    '_DAZ': '太宰府市-福岡縣',
    '_KTK': '北九州市-福岡縣',
    '_YNG': '柳川市-福岡縣',
    '_OTS': '大分市-大分縣',
    '_NGS': '長崎市-長崎縣',
    '_KMI': '宮崎市-宮崎縣',
    '_KIR': '霧島-鹿兒島縣',
    '_HIT': '日立市-茨城縣',
    '_YKO': '橫須賀市-神奈川縣',
    '_KWG': '川越市-埼玉縣'
  },
  '_KR': {
    '_': '不限',
    '_SEL': '首爾',
    '_PUS': '釜山',
    '_CJU': '濟州島'
  }
};